Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_RectangleProfile Properties
The IFC2X3_ParametricObject_RectangleProfile type exposes the following members.
Properties
Name | Description
Description
 The description of the product.
 (Inherited from ReferenceModelObjectAttribute.)
Extrusion
 The extrusion vector.
 (Inherited from ReferenceModelObjectAttribute.)
Name
 The name of the product.
 (Inherited from ReferenceModelObjectAttribute.)
ObjectType
 The object type of the product.
 (Inherited from ReferenceModelObjectAttribute.)
Origin
 The origin of the extrusion.
 (Inherited from ReferenceModelObjectAttribute.)
ProfileName
 The name of the profile (often empty).
 (Inherited from ReferenceModelObjectAttribute.)
XDim
 The X dimension.
xDir
 The X-axis direction.
 (Inherited from ReferenceModelObjectAttribute.)
YDim
 The Y dimension.
Top
See Also
Reference
IFC2X3_ParametricObject_RectangleProfile Class
Tekla.Structures.Model.Collaboration Namespace